In [1]:
# Import Variables
import numpy as np
import pandas as pd
import os
import gc
import sqlalchemy as db
from sqlalchemy import create_engine
import pymysql
from datetime import date, datetime

In [88]:
# Get Project dataset
# link dataset with bill dataset
engine = db.create_engine('mysql+pymysql://admin:password@10.140.9.159:3306/datacentralserver', echo=True)
bill_df = pd.read_sql_query("SELECT * FROM bill",engine)
plan_df = pd.read_sql_query("SELECT SOWNo AS sow_no, IFNULL(HoursTeam1,0) + IFNULL(HoursTeam2,0) + IFNULL(HoursTeam3,0) + IFNULL(HoursTeam4,0) + IFNULL(HoursTeam5,0) AS plan FROM projecttrackert WHERE Dashboard = 'True' AND Client = 'Siemens' AND year ='2020' AND HoursTeam1 != 0  ORDER BY SOWNo",engine)
resource_df = pd.read_sql_query("SELECT EASiID as easi_id, ClientCode as client_code, Department as department FROM personnelt WHERE Active='Yes' AND ClientCode NOT IN(SELECT clientCode from personnelt WHERE clientcode IN('','Internal'))",engine)

2019-12-06 11:55:44,656 INFO sqlalchemy.engine.base.Engine SHOW VARIABLES LIKE 'sql_mode'
2019-12-06 11:55:44,657 INFO sqlalchemy.engine.base.Engine {}
2019-12-06 11:55:44,689 INFO sqlalchemy.engine.base.Engine SHOW VARIABLES LIKE 'lower_case_table_names'
2019-12-06 11:55:44,690 INFO sqlalchemy.engine.base.Engine {}
2019-12-06 11:55:44,746 INFO sqlalchemy.engine.base.Engine SELECT DATABASE()
2019-12-06 11:55:44,747 INFO sqlalchemy.engine.base.Engine {}
2019-12-06 11:55:44,805 INFO sqlalchemy.engine.base.Engine show collation where `Charset` = 'utf8mb4' and `Collation` = 'utf8mb4_bin'
2019-12-06 11:55:44,806 INFO sqlalchemy.engine.base.Engine {}
2019-12-06 11:55:44,833 INFO sqlalchemy.engine.base.Engine SELECT CAST('test plain returns' AS CHAR(60)) AS anon_1
2019-12-06 11:55:44,834 INFO sqlalchemy.engine.base.Engine {}
2019-12-06 11:55:44,860 INFO sqlalchemy.engine.base.Engine SELECT CAST('test unicode returns' AS CHAR(60)) AS anon_1
2019-12-06 11:55:44,862 INFO sqlalchemy.engine.base.Engine {}
2019-12-06 11:55:44,890 INFO sqlalchemy.engine.base.Engine SELECT CAST('test collated returns' AS CHAR CHARACTER SET utf8mb4) COLLATE utf8mb4_bin AS anon_1
2019-12-06 11:55:44,891 INFO sqlalchemy.engine.base.Engine {}
2019-12-06 11:55:44,942 INFO sqlalchemy.engine.base.Engine SELECT * FROM bill
2019-12-06 11:55:44,944 INFO sqlalchemy.engine.base.Engine {}
2019-12-06 11:55:45,182 INFO sqlalchemy.engine.base.Engine SELECT SOWNo AS sow_no, IFNULL(HoursTeam1,0) + IFNULL(HoursTeam2,0) + IFNULL(HoursTeam3,0) + IFNULL(HoursTeam4,0) + IFNULL(HoursTeam5,0) AS plan FROM projecttrackert WHERE Dashboard = 'True' AND Client = 'Siemens' AND year ='2020' AND HoursTeam1 != 0  ORDER BY SOWNo
2019-12-06 11:55:45,184 INFO sqlalchemy.engine.base.Engine {}
2019-12-06 11:55:45,241 INFO sqlalchemy.engine.base.Engine SELECT EASiID as easi_id, ClientCode as client_code, Department as department FROM personnelt WHERE Active='Yes' AND ClientCode NOT IN(SELECT clientCode from personnelt WHERE clientcode IN('','Internal'))
2019-12-06 11:55:45,242 INFO sqlalchemy.engine.base.Engine {}

In [89]:
# Dataset
plan_df['sow_no'] = plan_df['sow_no'].str.split('-').str[0]
bill_df['sow_no'] = bill_df['sow_no'].str.split('-').str[0]
actual_df = bill_df.groupby('sow_no')['hours'].sum().reset_index()

In [92]:
combined_df = plan_df.merge(actual_df, on='sow_no', how='left')
combined_df

           sow_no  plan    hours
0    E1B100350198   900   341.00
1    E1B100370363  1000   115.75
2    E1B100370364  2000   153.00
3    E1B100370365  1000    36.75
4    E1B100396106  7432  1288.00
5    E1B100483909   840      NaN
6   E1B100570698   4200      NaN
7    E1B100573633  1350    19.00
8    E1B100575891    50    48.50
9    E1B100579984  9000  1372.00
10   E1B100581392  1800   580.00
11   E1B100581465   900      NaN
12   E1B100581824   852   504.00
13   E1B100586528   837      NaN
14   E1B100587058   864      NaN
15   E1B100587059   316      NaN
16   E1B100587975  1200      NaN
17   E1B100589511  1440    31.00
18   E1B100589515  2250      NaN
19   E1B100593628  3060      NaN
20   E1B100594016   640      NaN
21   E1B100594017   640      NaN
22   E1B100595222  3060      NaN
23   E1B100598717   320      NaN
24   E1B100601925    68      NaN
25   E1B100601927  5050      NaN
26   E1B100607271  1140      NaN
27   E1B100607322   900      NaN

In [100]:
bill_df['client_code'].unique()

array(['CAT', 'SIE', 'HUT', 'HAL', 'PAR'], dtype=object)